app/models/concerns/current_cart.rb

    def set_cart
        @cart = Cart.find(session[:cart_id])
    rescue ActiveRecord::RecordNotFound
    @cart = Cart.create
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 121], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-07-03 08:32:05.817388"], ["updated_at", "2019-07-03 08:32:05.817388"]]