app/controllers/line_items_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-07-03 08:40:24.453553"], ["updated_at", "2019-07-03 08:40:24.453553"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["product_id", 4], ["cart_id", 19], ["created_at", "2019-07-03 08:43:51.642177"], ["updated_at", "2019-07-03 08:43:51.642177"]]
UPDATE "line_items" SET "quantity" = $1, "updated_at" = $2 WHERE "line_items"."id" = $3  [["quantity", 2], ["updated_at", "2019-07-03 11:01:16.922054"], ["id", 18]]
---
  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product)

    respond_to do |format|
      if @line_item.save