app/controllers/products_controller.rb

SELECT "products".* FROM "products" ORDER BY created_at desc
---
  def index
    @products = Product.all.order("created_at desc")

INSERT INTO "products" ("title", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "holden"], ["description", "car"], ["price", "3000.0"], ["created_at", "2019-07-02 18:01:38.157454"], ["updated_at", "2019-07-02 18:01:38.157454"]]
---
  def create
    @product = current_user.products.build(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "updated_at" = $1 WHERE "products"."id" = $2  [["updated_at", "2019-07-02 18:07:43.147111"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)